<!-- add-pr-comment:add-pr-comment -->

## Terraform CloudWatch Alarms plan
```
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=4ad807d81410d5661f316112fe72a38c35309927]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_log_metric_filter.default: Refreshing state... [id=Levgorbunov1CancelWorkflowEvents]
aws_iam_policy.alarm_handler_lambda_policy: Refreshing state... [id=arn:aws:iam::880656497252:policy/lambda-cloudwatch-sns-policy]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_log_metric_filter.default: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEvents]
aws_iam_role.alarm_handler_lambda_role: Refreshing state... [id=alarm_handler_lambda_role]
module.operations_engineering_topic.aws_sns_topic.default: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts]
aws_iam_role_policy_attachment.alarm_handler_lambda_policy_attachment: Refreshing state... [id=alarm_handler_lambda_role-20241217153150732300000001]
aws_lambda_function.alarm_handler_lambda: Refreshing state... [id=cloudwatch_alarm_handler]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_metric_alarm.default: Refreshing state... [id=UnathorisedUsersModifyRepositorySettingsEventsAlarm]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_metric_alarm.default: Refreshing state... [id=Levgorbunov1CancelWorkflowEventsAlarm]
module.operations_engineering_topic.aws_sns_topic_subscription.default["lev.gorbunov@digital.justice.gov.uk"]: Refreshing state... [id=arn:aws:sns:eu-west-2:880656497252:operations-engineering-github-alerts:65ce29ca-d1be-467d-a0ff-d5baf744bcce]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_event_rule.default: Refreshing state... [id=alarm-state-change-rule]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_event_rule.default: Refreshing state... [id=alarm-state-change-rule]
module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_event_target.default: Refreshing state... [id=alarm-state-change-rule-terraform-20241217155940126600000001]
module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_event_target.default: Refreshing state... [id=alarm-state-change-rule-terraform-20241217155940700900000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_event_rule.default must be replaced
-/+ resource "aws_cloudwatch_event_rule" "default" {
      ~ arn            = "arn:aws:events:eu-west-2:880656497252:rule/alarm-state-change-rule" -> (known after apply)
      ~ id             = "alarm-state-change-rule" -> (known after apply)
      - is_enabled     = true -> null
      ~ name           = "alarm-state-change-rule" -> "Levgorbunov1CancelWorkflowEventsAlarm-event-rule" # forces replacement
      + name_prefix    = (known after apply)
      - state          = "ENABLED" -> null
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.levgorbunov1_cancel_workflow_alarm.aws_cloudwatch_event_target.default must be replaced
-/+ resource "aws_cloudwatch_event_target" "default" {
      ~ id             = "alarm-state-change-rule-terraform-20241217155940700900000002" -> (known after apply)
      ~ rule           = "alarm-state-change-rule" -> "Levgorbunov1CancelWorkflowEventsAlarm-event-rule" # forces replacement
      ~ target_id      = "terraform-20241217155940700900000002" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_event_rule.default must be replaced
-/+ resource "aws_cloudwatch_event_rule" "default" {
      ~ arn            = "arn:aws:events:eu-west-2:880656497252:rule/alarm-state-change-rule" -> (known after apply)
      ~ event_pattern  = jsonencode(
          ~ {
              ~ detail      = {
                  ~ alarmName = [
                      - "Levgorbunov1CancelWorkflowEventsAlarm",
                      + "UnathorisedUsersModifyRepositorySettingsEventsAlarm",
                    ]
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
      ~ id             = "alarm-state-change-rule" -> (known after apply)
      - is_enabled     = true -> null
      ~ name           = "alarm-state-change-rule" -> "UnathorisedUsersModifyRepositorySettingsEventsAlarm-event-rule" # forces replacement
      + name_prefix    = (known after apply)
      - state          = "ENABLED" -> null
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.unauthorised_users_modify_repository_settings_alarm.aws_cloudwatch_event_target.default must be replaced
-/+ resource "aws_cloudwatch_event_target" "default" {
      ~ id             = "alarm-state-change-rule-terraform-20241217155940126600000001" -> (known after apply)
      ~ rule           = "alarm-state-change-rule" -> "UnathorisedUsersModifyRepositorySettingsEventsAlarm-event-rule" # forces replacement
      ~ target_id      = "terraform-20241217155940126600000001" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```